Repository: MichaelDark/grand_tour_yt
Catalog: lib/l10n/strings_*.arb
Languages: es, fr, uk

# appName
source: Grand Tour YT Demo
es: Grand Tour YT Demostración
fr: Grand Tour YT Démo
uk: Grand Tour YT Демо

# demoLabel
source: demo
es: demostración
fr: démo
uk: демо

# errorViewHint
source: Ooopsy, looks like an error occured
es: Ups, parece que ocurrió un error
fr: Oups, on dirait qu'une erreur s'est produite
uk: Ууупсі, лишенько трапилося

# errorViewRetryLabel
source: Retry
es: Rever
fr: Recommencez
uk: Спробувати ще

# splashText
source: Starting up...
es: Empezando...
fr: Démarrage...
uk: Запускаємо додаток...

# signInPageHint
source: We need your Google Account to access Youtube
es: Necesitamos tu cuenta de Google para acceder a Youtube
fr: Nous avons besoin de votre compte Google pour accéder à Youtube
uk: Нам потрібен ваш Google акаунт для доступу до Youtube

# signInPageButtonLabel
source: Sign In
es: Registrarse
fr: S'identifier
uk: Увійти

# channelsPageTitle
source: Favourite channels
es: Canales favoritos
fr: Chaînes préférées
uk: Улюблені канали

# nSubscribers
source: {count,plural, =0{0 subscribers} =1{{count} subscriber} other{{count} subscribers}}
es: {count,plural, =0{0 suscriptores} =1{{count} suscriptor} other{{count} suscriptores}}
fr: {count,plural, =0{0 abonnés} =1{{count} abonné} other{{count} abonnés}}
uk: {count,plural, =0{0 підписників} =1{{count} підписник} other{{count} підписників}}

# nVideos
source: {count,plural, =0{0 videos} =1{{count} video} other{{count} videos}}
es: {count,plural, =0{0 vídeos} =1{{count} vídeo} other{{count} vídeos}}
fr: {count,plural, =0{0 vidéos} =1{{count} vidéo} other{{count} vidéos}}
uk: {count,plural, other{{count} відео}}

# nViews
source: {count,plural, =0{0 views} =1{{count} view} other{{count} views}}
es: {count,plural, =0{0 vistas} =1{{count} vista} other{{count} vistas}}
fr: {count,plural, =0{0 vues} =1{{count} vue} other{{count} vues}}
uk: {count,plural, =0{0 переглядів} =1{{count} перегляд} other{{count} переглядів}}

# uploadedVideosCaption
source: Uploaded videos
es: Vídeos subidos
fr: Vidéos téléchargées
uk: Завантажені відео

# playlistsCaption
source: Playlists
es: Listas de reproducción
fr: Listes de lecture
uk: Плейлисти

# videoLicencedLabel
source: Licenced
es: Con licencia
fr: Autorisé
uk: Ліцензоване

# settingsPageTitle
source: Settings
es: Ajustes
fr: Réglages
uk: Налаштування

# settingsPageThemeTitle
source: Theme
es: Tema
fr: Thème
uk: Тема

# settingsPageThemeSubtitle
source: Tap to toggle dark and light theme
es: Toque para alternar el tema claro y oscuro
fr: Appuyez pour basculer entre les thèmes sombre et clair
uk: Натисніть аби перемкнути тему

# settingsPageLanguageSubtitle
source: Tap to change language
es: Toca para cambiar el idioma
fr: Appuyez pour changer de langue
uk: Натисніть аби змінити мову застосунку

# settingsPageClearSearchHistoryTitle
source: Clear Search History
es: Limpiar historial de búsqueda
fr: Effacer l'historique
uk: Видалити історію пошуку

# settingsPageClearSearchHistorySubtitle
source: Tap to clear search history across for videos across all channels
es: Toque para borrar el historial de búsqueda de videos en todos los canales
fr: Appuyez pour effacer l'historique de recherche des vidéos sur tous les canaux
uk: Натисніть аби видалити історію пошуку відео по каналах

# searchErrorEmpty
source: Enter search query in the field above
es: Introduzca la consulta de búsqueda en el campo de arriba
fr: Entrez la requête de recherche dans le champ ci-dessus
uk: Введіть пошуковий запит у поле вище

# searchErrorMoreThenTwoSymbols
source: Search term must be longer than two letters
es: El término de búsqueda debe tener más de dos letras
fr: Le terme de recherche doit comporter plus de deux lettres
uk: Пошуковий запит повинен бути довший за два символи

# clearSearchHistoryDialogTitle
source: Clear Search History
es: Limpiar historial de búsqueda
fr: Effacer l'historique
uk: Видалення історії пошуку

# clearSearchHistoryDialogPrompt
source: Are you sure you want to clear search history? This action cannot be undone.
es: ¿Está seguro de que desea borrar el historial de búsqueda? Esta acción no se puede deshacer.
fr: Voulez-vous vraiment effacer l'historique des recherches ? Cette action est irréversible.
uk: Вви впевнені, що ви хочете видалити історію пошуку? Ця дія не може бути скасована.

# clearSearchHistoryDialogPositiveButton
source: Clear history
es: Borrar historial
fr: Histoire claire
uk: Видалити історію

# clearSearchHistoryDialogNegativeButton
source: Cancel
es: Cancelar
fr: Annuler
uk: Відмінити
